Documents/DMS_ЗаменаКартЛояльности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>DMS_ЗаменаКартЛояльности</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Renault_ОстаткиБаллов</xr:Item>
				<xr:Item>AccumulationRegister.DMS_БонусныеБаллы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.DMS_ВидыОперацийКартЛояльности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.DMS_СтатусЗаменыКарт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказНаряд</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КартыПокупателей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КартаИсточник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Renault_КартыЛояльности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КартаПриемник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Renault_КартыЛояльности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номинал</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидКарты</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.DMS_ВидыКартЛояльности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПогаситьДо</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/DMS_ЗаменаКартЛояльности/Forms/ФормаВыбораПрограммЛояльности/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("МассивВариантовЗамены") Тогда
	
		Для каждого ТекущийВаринт Из Параметры.МассивВариантовЗамены Цикл
		
			НоваяСтрока = ТаблицаВариантовЗамены.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,ТекущийВаринт);
		
		КонецЦикла; 	
		
	Иначе 
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_ЗаменыКарты" 
		И Параметр = ЭтаФорма Тогда
	
		Закрыть();
	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	СтруктураДанных = Новый Структура("Контрагент,ВидОперации,Дата,КартаИсточник,КартаПриемник,ВидКарты,Номинал,ЗаказНаряд");
	
	Выбран = Ложь;
	
	Для каждого ТекущаяСтрока Из ТаблицаВариантовЗамены Цикл
	
		Если ТекущаяСтрока.Выбрать Тогда
			
			ЗаполнитьЗначенияСвойств(СтруктураДанных,ТекущаяСтрока);
			Выбран = Истина;
			
		КонецЕсли; 
	
	КонецЦикла; 
	
	Если Выбран Тогда
		
		ПараметрыФормы = Новый Структура("ДанныеДляЗаменыДисконтнойКарты,ЗакрыватьПриЗакрытииВладельца",СтруктураДанных,Ложь);
		
		ОткрытьФорму("Документ.DMS_ЗаменаКартЛояльности.Форма.ФормаДокумента",ПараметрыФормы,ЭтаФорма);
				
	Иначе 
		Предупреждение("Выберите вид карты!",15,"Не выбран вид карты");
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВариантовЗаменыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВариантовЗаменыПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВариантовЗаменыВыбратьПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ТаблицаВариантовЗамены.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Если Не ТекущаяСтрока.Выбрать Тогда
		Возврат;
	КонецЕсли; 
	
	Для каждого СтрокаТаблицы Из ТаблицаВариантовЗамены Цикл
	
		Если СтрокаТаблицы = ТекущаяСтрока Тогда
			Продолжить;
		КонецЕсли; 		
		
		СтрокаТаблицы.Выбрать = Ложь;
		
	КонецЦикла; 
	
КонецПроцедуры
